; domain
; logistics domain Typed version.

(define (domain logistics )
    (:requirements :strips :typing :negative-preconditions)
    (:types
        physobj place city - object
        vehicle package - physobj
        location airport - place
        airplane truck - vehicle
    )
    (:predicates
        (in ?a - package ?b - vehicle)
        (in-city ?a - place ?b - city)
        (at ?a - physobj ?b - place)
    )
    (:action LOAD-TRUCK
        :parameters (?pkg - package ?truck - truck ?loc - place )
        :precondition (and 
            (at ?pkg ?loc)
            (at ?truck ?loc)
            
        )
        :effect (and 
            (in ?pkg ?truck)
            (not (at ?pkg ?loc))
        )
    )
    (:action LOAD-AIRPLANE
        :parameters (?pkg - package ?airplane - airplane ?loc - place )
        :precondition (and 
            (at ?pkg ?loc)
            (at ?airplane ?loc)
            
        )
        :effect (and 
            (in ?pkg ?airplane)
            (not (at ?pkg ?loc))
        )
    )
    (:action UNLOAD-TRUCK
        :parameters (?pkg - package ?truck - truck ?loc - place )
        :precondition (and 
            (at ?truck ?loc)
            (in ?pkg ?truck)
            
        )
        :effect (and 
            (at ?pkg ?loc)
            (not (in ?pkg ?truck))
        )
    )
    (:action UNLOAD-AIRPLANE
        :parameters (?pkg - package ?airplane - airplane ?loc - place )
        :precondition (and 
            (at ?airplane ?loc)
            (in ?pkg ?airplane)
            
        )
        :effect (and 
            (at ?pkg ?loc)
            (not (in ?pkg ?airplane))
        )
    )
    (:action DRIVE-TRUCK
        :parameters (?truck - truck ?loc-from - place ?loc-to - place ?city - city )
        :precondition (and 
            (in-city ?loc-from ?city)
            (in-city ?loc-to ?city)
            (at ?truck ?loc-from)
            
        )
        :effect (and 
            (at ?truck ?loc-to)
            (not (at ?truck ?loc-from))
        )
    )
    (:action FLY-AIRPLANE
        :parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport )
        :precondition (and 
            (at ?airplane ?loc-from)
            
        )
        :effect (and 
            (at ?airplane ?loc-to)
            (not (at ?airplane ?loc-from))
        )
    )
)

; problem
(define (problem logistics-4-0)
    (:domain logistics )
    (:objects
         obj23 obj22 obj21 obj13 obj12 obj11 - package
         tru2 tru1 - truck
         apn1 - airplane
         cit2 cit1 - city
         pos2 pos1 - location
         apt2 apt1 - airport
    )
    (:init
        (at obj11 pos1)
        (at obj12 pos1)
        (at obj13 pos1)
        (at obj21 pos2)
        (at obj22 pos2)
        (at tru1 pos1)
        (at tru2 pos2)
        (at obj23 pos2)
        (at apn1 apt2)
        (in-city pos1 cit1)
        (in-city pos2 cit2)
        (in-city apt2 cit2)
        (in-city apt1 cit1)
    )
    (:goal
        (and 
            (at obj13 apt1)
            (at obj21 pos1)
            (at obj11 apt1)
            (at obj23 pos1)
        )
    )
)

; plan
1. (load-truck obj21 tru2 pos2)
   deleted: (at obj21 pos2)
   added: (in obj21 tru2)
   goals met: 0 of 4
2. (load-truck obj23 tru2 pos2)
   deleted: (at obj23 pos2)
   added: (in obj23 tru2)
   goals met: 0 of 4
3. (drive-truck tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 0 of 4
4. (unload-truck obj23 tru2 apt2)
   deleted: (in obj23 tru2)
   added: (at obj23 apt2)
   goals met: 0 of 4
5. (load-airplane obj23 apn1 apt2)
   deleted: (at obj23 apt2)
   added: (in obj23 apn1)
   goals met: 0 of 4
6. (unload-truck obj21 tru2 apt2)
   deleted: (in obj21 tru2)
   added: (at obj21 apt2)
   goals met: 0 of 4
7. (load-airplane obj21 apn1 apt2)
   deleted: (at obj21 apt2)
   added: (in obj21 apn1)
   goals met: 0 of 4
8. (load-truck obj13 tru1 pos1)
   deleted: (at obj13 pos1)
   added: (in obj13 tru1)
   goals met: 0 of 4
9. (fly-airplane apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 0 of 4
10. (load-truck obj11 tru1 pos1)
   deleted: (at obj11 pos1)
   added: (in obj11 tru1)
   goals met: 0 of 4
11. (unload-airplane obj23 apn1 apt1)
   deleted: (in obj23 apn1)
   added: (at obj23 apt1)
   goals met: 0 of 4
12. (unload-airplane obj21 apn1 apt1)
   deleted: (in obj21 apn1)
   added: (at obj21 apt1)
   goals met: 0 of 4
13. (drive-truck tru1 pos1 apt1 cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 apt1)
   goals met: 0 of 4
14. (load-truck obj23 tru1 apt1)
   deleted: (at obj23 apt1)
   added: (in obj23 tru1)
   goals met: 0 of 4
15. (load-truck obj21 tru1 apt1)
   deleted: (at obj21 apt1)
   added: (in obj21 tru1)
   goals met: 0 of 4
16. (unload-truck obj13 tru1 apt1)
   deleted: (in obj13 tru1)
   added: (at obj13 apt1)
   goals met: 1 of 4
17. (unload-truck obj11 tru1 apt1)
   deleted: (in obj11 tru1)
   added: (at obj11 apt1)
   goals met: 2 of 4
18. (drive-truck tru1 apt1 pos1 cit1)
   deleted: (at tru1 apt1)
   added: (at tru1 pos1)
   goals met: 2 of 4
19. (unload-truck obj23 tru1 pos1)
   deleted: (in obj23 tru1)
   added: (at obj23 pos1)
   goals met: 3 of 4
20. (unload-truck obj21 tru1 pos1)
   deleted: (in obj21 tru1)
   added: (at obj21 pos1)
   goals met: 4 of 4
